Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་གཟུང་དུ་མེད་དོ།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great compassion, and the eighteen distinct qualities of the buddhas cannot be grasped.

source: །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་གཟུང་དུ་མེད་པར། བྱས་ཤིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་ཏོ།
en: Therefore, bodhisattva great beings, knowing that all attributes cannot be grasped, strive toward unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་གཟུང་དུ་མེད་ཅིང་དངོས་པོ་མེད་པ་སྟེ། རྨི་ལམ་ལྟ་བུ་སྒྲ་བརྙན་ལྟ་བུ། མིག་ཡོར་ལྟ་བུ་སྨིག་རྒྱུ་ལྟ་བུ། སྒྱུ་མ་ལྟ་བུ་སྤྲུལ་པ་ལྟ་བུ་སྟེ།
en: If you ask why, it is because all phenomena are ungraspable nonentities, like a dream, like an echo, like an optical aberration, like a mirage, like a magical display, and like a phantom emanation.

source: སེམས་ཅན་རྣམས་ཀྱིས་ཆོས་དེ་དག་མ་ཤེས་མ་མཐོང་མ་རྟོགས་པར་བཟུང་དུ་མེད་པའི་ཆོས་ཀྱིས་བཟུང་དུ་མེད་པའི་ཆོས་གང་ཡང་ཐོབ་པར་མི་ནུས་པས་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་འཇུག་སྟེ།
en: An ungraspable phenomenon cannot attain anything that is ungraspable, except in the case of beings who do not know, see, or understand these attributes. This is why bodhisattva great beings set out for unsurpassed, complete enlightenment for the sake of all beings.

source: དེ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྦྱིན་པ་གང་ཅི་གཏོང་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་གཏོང་ངོ་། །ཚུལ་ཁྲིམས་གང་ཅི་སྲུང་བ་དང་།
en: From the time when they first begin to set their minds on enlightenment, whatever gifts they dispense, they dispense them for the sake of all beings.

source: བཟོད་པ་གང་ཅི་སྒོམ་པ་དང་། བརྩོན་འགྲུས་གང་ཅི་རྩོམ་པ་དང་། བསམ་གཏན་གང་ཅི་ལ་མཉམ་པར་གཞོག་པ་དང་། ཤེས་རབ་གང་ཅི་སྒོམ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་སྒོམ་སྟེ། བདག་གི་དོན་དུ་མ་ཡིན་ནོ།
en: Whatever ethical discipline they maintain, whatever tolerance they cultivate, whatever [acts of] perseverance they undertake, whatever meditative concentration they are absorbed in, and whatever wisdom they cultivate, they do so for the sake of all beings, and not for their own sake. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་རྣམས་ཀྱི་དོན་མ་གཏོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མི་འཇུག་སྟེ། དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་གང་སེམས་ཅན་མེད་པ་ལ་སེམས་ཅན་གྱི་འདུ་ཤེས་སུ་གནས་པ་དང་། བདག་མེད་པ་ལ་བདག་གི་འདུ་ཤེས་སུ་གནས་པ་དང་།
en: Bodhisattva great beings do not set out for unsurpassed, complete enlightenment except for the sake of beings. {

source: སྲོག་མེད་པ་ལ་སྲོག་གི་འདུ་ཤེས་སུ་གནས་པ་དང་། འགྲོ་བ་མེད་པ་ལ་འགྲོ་བའི་འདུ་ཤེས་སུ་གནས་པ་དང་།
en: Ki.

source: གསོ་བ་མེད་པ་ལ་གསོ་བའི་འདུ་ཤེས་སུ་གནས་པ་དང་། སྐྱེས་བུ་མེད་པ་ལ་སྐྱེས་བུའི་འདུ་ཤེས་སུ་གནས་པ་དང་། གང་ཟག་མེད་པ་ལ་གང་ཟག་གི་འདུ་ཤེས་སུ་གནས་པ་དང་། ཤེད་ཅན་མེད་པ་ལ་ཤེད་ཅན་གྱི་འདུ་ཤེས་སུ་གནས་པ་དང་། ཤེད་བདག་མེད་པ་ལ་ཤེད་བདག་གི་འདུ་ཤེས་སུ་གནས་པ་དང་། བྱེད་པ་པོ་མེད་པ་ལ་བྱེད་པ་པོའི་འདུ་ཤེས་སུ་གནས་པ་དང་། བྱེད་དུ་འཇུག་པ་པོ་མེད་པ་ལ་བྱེད་དུ་འཇུག་པ་པོའི་འདུ་ཤེས་སུ་གནས་པ་དང་། སློང་བ་པོ་མེད་པ་ལ་སློང་བ་པོའི་འདུ་ཤེས་སུ་གནས་པ་དང་། སློང་དུ་འཇུག་པ་པོ་མེད་པ་ལ་སློང་དུ་འཇུག་པ་པོའི་འདུ་ཤེས་སུ་གནས་པ་དང་། ཚོར་བ་པོ་མེད་པ་ལ་ཚོར་བ་པོའི་འདུ་ཤེས་སུ་གནས་པ་དང་། ཚོར་དུ་འཇུག་པ་པོ་མེད་པ་ལ་ཚོར་དུ་འཇུག་པ་པོའི་འདུ་ཤེས་སུ་གནས་པ་དང་། ཤེས་པ་པོ་མེད་པ་ལ་ཤེས་པ་པོའི་འདུ་ཤེས་སུ་གནས་པ་དང་།
en: VIII: 168} When they practice the perfection of wisdom, they liberate from erroneous views those harboring the notion of beings where there are no beings, harboring the notion of self where there is no self, harboring the notion of life forms where there are no life forms, harboring the notion of living beings where there are no living beings, harboring the notion of life where there is no life, harboring the notion of living creatures where there are no living creatures, harboring the notion of individual personalities where there are no individual personalities, harboring the notion of human beings where there are no human beings, harboring the notion of people where there are no people, harboring the notion of actors where there are no actors, harboring the notion of agents where there are no agents, harboring the notion of petitioners where there are no petitioners, harboring the notion of instigators of petitions where there are no instigators of petitions, harboring the notion of experiencers where there are no experiencers, harboring the notion of instigators of experience where there are no instigators of experience, harboring the notion of knowers where there are no knowers, and harboring the notion of viewers where there are no viewers.

source: མཐོང་བ་པོ་མེད་པ་ལ་མཐོང་བ་པོའི་འདུ་ཤེས་སུ་གནས་པ་དེ་དག་ཕྱིན་ཅི་ལོག་ལས་རྣམ་པར་འགྲོལ་ཏེ། ཕྱིན་ཅི་ལོག་ལས་རྣམ་པར་བཀྲོལ་ཞིང་འཆི་བ་མེད་པའི་དབྱིངས་སུ་འགོད་དོ།
en: After liberating them from these erroneous views, they establish them in the deathless expanse.

source: །དེ་ལ་བཀོད་ནས་རྒྱུ་བ་འདི་དག་ཡོངས་སུ་མི་རྒྱུ་སྟེ། བདག་གི་འདུ་ཤེས་སམ། སེམས་ཅན་གྱི་འདུ་ཤེས་སམ། སྲོག་གི་འདུ་ཤེས་སམ། འགྲོ་བའི་འདུ་ཤེས་སམ། གསོ་བའི་འདུ་ཤེས་སམ།
en: Having established them in that, those habitual notions no longer proliferate.

source: སྐྱེས་བུའི་འདུ་ཤེས་སམ། གང་ཟག་གི་འདུ་ཤེས་སམ། ཤེད་ཅན་གྱི་འདུ་ཤེས་སམ། ཤེད་བདག་གི་འདུ་ཤེས་སམ། བྱེད་པ་པོའི་འདུ་ཤེས་སམ། བྱེད་དུ་འཇུག་པ་པོའི་འདུ་ཤེས་སམ། སློང་བ་པོའི་འདུ་ཤེས་སམ། སློང་དུ་འཇུག་པ་པོའི་འདུ་ཤེས་སམ། ཚོར་བ་པོའི་འདུ་ཤེས་སམ། ཚོར་དུ་འཇུག་པ་པོའི་འདུ་ཤེས་སམ། ཤེས་པ་པོའི་འདུ་ཤེས་སམ།
en: That is to say, the notion of self, the notion of beings, the notion of life forms, the notion of living beings, the notion of life, the notion of living creatures, the notion of individual personalities, the notion of human beings, the notion of persons, the notion of actors, the notion of agents, the notion of petitioners, the notion of instigators of petitions, the notion of experiencers, the notion of instigators of experience, the notion of knowers, or the notion of viewers no longer proliferates.

source: མཐོང་བ་པོའི་འདུ་ཤེས་ཡོངས་སུ་མི་རྒྱུ་སྟེ། དེ་གཡོ་བ་དང་། རློམ་སེམས་དང་། འབར་བ་དང་སྤྲོས་པ་འདི་དག་བཏང་ནས། སྤྲོས་པ་མེད་པའི་སེམས་ཀྱིས་ཉེ་བར་བསྒྲུབས་ཤིང་མང་དུ་སྤྱོད་དེ།
en: Having abandoned these restless conceits and burning conceptual elaborations, they approach with a mind free from conceptual elaboration, and achieve much.

source: རབ་འབྱོར་རྣམ་གྲངས་དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བདག་ཉིད་ཀྱང་ཆོས་གང་ལ་ཡང་མངོན་པར་ཞེན་པ་མེད་ལ། སེམས་ཅན་ཐམས་ཅད་ཀྱང་མངོན་པར་ཞེན་པ་མེད་པ་ལ་རབ་ཏུ་འགོད་དེ།
en: For this reason, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they themselves are not fixated on anything at all, and they also establish all beings in nonfixation.

source: དེ་ནི་འཇིག་རྟེན་གྱི་ཐ་སྙད་ཀྱི་དོན་དམ་པར་ནི་མ་ཡིན་ནོ། །གསོལ་པ།
en: This they do by way of mundane convention, not ultimate reality.” “

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སམ། མ་ལགས་ཀྱི་དོན་དམ་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Blessed Lord, regarding this attainment of consummate buddhahood by the tathāgatas, is consummate buddhahood attained by way of mundane convention or, otherwise, by way of ultimate reality?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་བཞིན་གཤེགས་པས་ཆོས་འདི་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་བརྗོད་པ་སྟེ།
en: It is in mundane conventional terms that one speaks of ‘this attainment of consummate buddhahood by the tathāgatas,’ ” replied the Blessed One. “

source: དེ་ལ་ཆོས་འདིས་ཆོས་འདི་ལྟ་བུ་ཞིག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །ཞེས་བྱ་བ་དེ་ལྟ་བུ་གང་ཡང་མི་དམིགས་ཏེ།
en: But nothing at all is apprehended when one says, ‘This is the attainment of consummate buddhahood by that.’

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་འདིས་ཆོས་འདི་ལྟ་བུ་ཞིག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་བྱ་བ་ནི་དམིགས་པ་སྟེ། གཉིས་ཀྱིས་ནི་གང་ཡང་ཐོབ་པ་འམ། མངོན་པར་རྟོགས་པར་འགྱུར་བ་མེད་དོ།
en: If you ask why, there is [dualistic] apprehending when one says, ‘This is the attainment of consummate buddhahood by that,’ but nothing at all is attained or clearly realized through duality.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་སྟེ་གཉིས་ཀྱིས་ཐོབ་པ་དང་། མངོན་པར་རྟོགས་པར་འགྱུར་བ་མ་མཆིས་ན། གཉིས་སུ་མ་མཆིས་པས་ཐོབ་པ་དང་། མངོན་པར་རྟོགས་པར་འགྱུར་རམ།
en: Blessed Lord, if nothing is attained or clearly realized through duality, is there any attainment or clear realization through nonduality?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཉིས་ཀྱིས་ཀྱང་ཐོབ་པ་དང་མངོན་པར་རྟོགས་པར་འགྱུར་བ་མེད་དེ། གཉིས་སུ་མེད་པས་ཀྱང་ཐོབ་པ་དང་མངོན་པར་རྟོགས་པར་འགྱུར་བ་མེད་དེ།
en: There is neither attainment nor clear realization through duality, nor is there any attainment or clear realization through nonduality,” replied the Blessed One. “

source: གང་ལ་གཉིས་ཀྱང་མེད་ལ་མི་གཉིས་པའང་མེད་པ་ནི་ཐོབ་པ་དང་མངོན་པར་རྟོགས་པ་ཞེས་བྱའོ།
en: Attainment and clear realization occur where there is neither duality nor nonduality.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་འདི་ནི་ཐོབ་པའོ།
en: If you ask why, it is because the expression, ‘This is attainment.

source: །འདི་ནི་མངོན་པར་རྟོགས་པའོ་ཞེས་བྱ་བ་ནི་སྤྲོས་པ་སྟེ། ཆོས་མཉམ་པ་ཉིད་ལ་སྤྲོས་པ་མེད་དེ།
en: This is clear realization,’ is a conceptual elaboration, and in the sameness of phenomena there is no conceptual elaboration. {

source: སྤྲོས་པ་མེད་པ་ནི་ཆོས་མཉམ་པ་ཉིད་དོ།
en: Ki.VIII: 169} The absence of conceptual elaboration is the sameness of phenomena.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཆོས་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་རྣམས་ལ་ཆོས་ཀྱི་མཉམ་པ་ཉིད་ཅེས་བགྱི་བ་ཡང་གང་ཞིག་མཆིས།
en: Blessed Lord, how are phenomena that have the nature of nonentity not entities if it is said that all phenomena have the nature of sameness?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་དངོས་པོ་མེད་པ་དང་དངོས་པོ་མེད་པ་ཡང་མ་ཡིན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་དང་ཡོངས་སུ་བརྗོད་པ་མེད་པ་འདི་ནི་ཆོས་མཉམ་པ་ཉིད་དེ།
en: The sameness of phenomena denotes that which is neither an entity, nor a nonentity, without inherent existence and without affirmation,” replied the Blessed One. “

source: ཆོས་མཉམ་པ་ཉིད་པོ་དེ་ནི་བརྗོད་དུ་མེད་པའོ།
en: The sameness of phenomena cannot be expressed.

source: །ཆོས་མཉམ་པ་ཉིད་མ་གཏོགས་པར་ཡང་དམིགས་པར་འགྱུར་བའི་ཆོས་གང་ཡང་མེད་དེ།
en: Apart from the sameness of phenomena, there is nothing at all that can be apprehended.

source: ཆོས་མཉམ་པ་ཉིད་ནི་ཆོས་ཐམས་ཅད་ལས་རྣམ་པར་འདས་པའོ།
en: The sameness of phenomena has transcended everything.

source: །ཆོས་མཉམ་པ་ཉིད་ནི་བྱིས་པ་འམ། འཕགས་པ་འམ། ཆོས་གང་གིས་ཀྱང་ཤེས་པར་མི་རུང་ཞིང་ཡུལ་མ་ཡིན་པའོ།
en: The sameness of phenomena is not an object that can be known by anyone at all—ordinary people or sublime beings.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཆོས་མཉམ་པ་ཉིད་པོ་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ཡང་མ་ལགས་སམ།
en: Blessed Lord, is the sameness of phenomena not even an object for the tathāgatas?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཆོས་མཉམ་པ་ཉིད་ནི་འཕགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་མ་ཡིན་པ་ཏེ། རྒྱུན་ཏུ་ཞུགས་པ་འམ།
en: The sameness of phenomena is not an object for any tathāgata,” replied the Blessed One. “

source: ལན་ཅིག་ཕྱིར་འོང་བ་འམ་ཕྱིར་མི་འོང་བ་འམ། དགྲ་བཅོམ་པ་འམ། རང་བྱང་ཆུབ་བམ། བྱང་ཆུབ་སེམས་དཔའ་འམ། དེ་བཞིན་གཤེགས་པའི་ཡུལ་མ་ཡིན་ནོ།
en: It is not an object for those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, arhats, pratyekabuddhas, bodhisattvas, or tathāgatas.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་མངའ་སྒྱུར་བ་མ་ལགས་སམ།
en: Blessed Lord, do the tathāgatas, arhats, completely awakened buddhas not have mastery over of all phenomenal objects?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གལ་ཏེ་ཆོས་མཉམ་པ་ཉིད་ཀྱང་གཞན་ལ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱང་གཞན་ཞིག་ཡིན་ན་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་མངའ་སྒྱུར་བར་ཡང་འགྱུར་ན། རབ་འབྱོར་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་གང་ཡིན་པ་དང་།
en: Subhūti,” replied the Blessed One, “if the sameness of phenomena were one distinct thing and the tathāgatas, arhats, completely awakened buddhas another, then the tathāgatas, arhats, completely awakened buddhas would indeed have control over all phenomenal objects.

source: རྒྱུན་དུ་ཞུགས་པ་རྣམས་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དང་ཕྱིར་མི་འོང་བ་རྣམས་དང་དགྲ་བཅོམ་པ་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་མཉམ་པ་ཉིད་གཅིག་པ་སྟེ།
en: However, Subhūti, the sameness of phenomena with respect to ordinary people and the sameness of phenomena with respect to those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, arhats, pratyekabuddhas, bodhisattvas, and tathāgatas is an identical sameness.

source: མཉམ་པ་ཉིད་དང་མི་མཉམ་པ་ཉིད་ལ་བྱེ་བྲག་གང་ཡང་མེད་དོ།
en: There is no distinction at all between sameness and nonsameness.

source: །དེ་ལྟར་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་མཉམ་པ་ཉིད་གང་ཡིན་པ་དང་། འཕགས་པ་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི། མཉམ་པ་ཉིད་གཅིག་པ་སྟེ།
en: So, the sameness of ordinary people and the sameness of all sublime beings is an identical sameness.

source: མཉམ་པ་ཉིད་གཅིག་པ་ལ་འདི་ནི་སོ་སོའི་སྐྱེ་བོའོ།
en: In this identical sameness, there is no duality that would enable you to say, ‘This is an ordinary person.

source: །འདི་ནི་རྒྱུན་དུ་ཞུགས་པའོ།
en: This one is entering the stream to nirvāṇa.

source: །འདི་ནི་ལན་ཅིག་ཕྱིར་འོང་བ་དང་།
en: This one is destined for only one more rebirth.

source: ཕྱིར་མི་འོང་བ་དང་།
en: This one is no longer subject to rebirth.

source: དགྲ་བཅོམ་པ་དང་།
en: This one is an arhat.

source: བྱང་ཆུབ་སེམས་དཔའོ།
en: This one is a bodhisattva.

source: །འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་བྱ་བར་གཉིས་སུ་བྱ་བ་མེད་དེ།
en: This one is a tathāgata, arhat, completely awakened buddha.’

source: རྣམ་པར་རྟོག་པ་དེ་དག་ནི་མཉམ་པ་ཉིད་ལ་མི་དམིགས་སོ།
en: Such conceptual thoughts are not apprehended in sameness.” {

source: བཅོམ་ལྡན་འདས་དེ་སྟེ་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ལ། འདི་ནི་སོ་སོའི་སྐྱེ་བོའོ།
en: VIII: 170} “Blessed Lord, if in the sameness of all phenomena there is no apprehending of the conceptual thoughts enabling one to say, ‘This is an ordinary person.

source: །འདི་ནི་ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའོ། །འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་བགྱི་བའི་རྣམ་པར་རྟོག་པ་དེ་དག་མི་དམིགས་ན། དེས་སོ་སོའི་སྐྱེ་བོ་རྣམས་དང་། རྒྱུན་དུ་ཞུགས་པ་རྣམས་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དང་།
en: These ones are destined for only one more rebirth, no longer subject to rebirth, an arhat, a pratyekabuddha, and a bodhisattva.

source: ཕྱིར་མི་འོང་བ་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཁྱད་པར་མ་མཆིས་པར་འགྱུར་རོ།
en: This one is a tathāgata, arhat, completely awakened buddha,’ in that case there would be no distinction between ordinary people, those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, arhats, pratyekabuddhas, bodhisattvas, and tathāgatas, arhats, completely awakened buddhas.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ལ་སོ་སོའི་སྐྱེ་བོ་རྣམས་དང་། རྒྱུན་དུ་ཞུགས་པ་རྣམས་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་།
en: Subhūti, it is so! It is so,” replied the Blessed One. “

source: རང་སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཁྱད་པར་མེད་དོ། །གསོལ་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ལ་སོ་སོའི་སྐྱེ་བོ་རྣམས་དང་། རྒྱུན་དུ་ཞུགས་པ་རྣམས་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དང་། ཕྱིར་མི་འོང་བ་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་ཁྱད་པར་མ་མཆིས་ན།
en: In the sameness of all phenomena there is no distinction between ordinary people, those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, arhats, pratyekabuddhas, bodhisattvas, and tathāgatas, arhats, completely awakened buddhas.” “

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ། སངས་རྒྱས་དཀོན་མཆོག་དང་། ཆོས་དཀོན་མཆོག་དང་། དགེ་འདུན་དཀོན་མཆོག་དང་། དཀོན་མཆོག་གསུམ་དེ་དག་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་བ་ལགས།
en: Blessed Lord, if in the sameness of all phenomena there is no distinction between ordinary people, those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, arhats, pratyekabuddhas, bodhisattvas, and tathāgatas, arhats, completely awakened buddhas, why, Blessed Lord, do the Three Precious Jewels—the precious jewel of the Buddha, the precious jewel of the Dharma, and the precious jewel of the Saṅgha—emerge in the world?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སངས་རྒྱས་དཀོན་མཆོག་ཀྱང་གཞན་ལ་ཆོས་དཀོན་མཆོག་ཀྱང་གཞན་ཏེ། དགེ་འདུན་དཀོན་མཆོག་ཀྱང་གཞན་ཞིག་ལ། ཆོས་མཉམ་པ་ཉིད་ཀྱང་གཞན་ཞིག་སྙམ་འམ།
en: Subhūti,” replied the Blessed One, “do you think that the precious jewel of the Buddha is one thing, the precious jewel of the Dharma another, the precious jewel of the Saṅgha another, and the sameness of phenomena yet another?” “

source: གསོལ་པ་བཅོམ་ལྡན་འདས་བདག་གིས། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་བ་ལྟར་ན། སངས་རྒྱས་དཀོན་མཆོག་ཀྱང་གཞན་ལ། ཆོས་དཀོན་མཆོག་ཀྱང་གཞན་ཏེ།
en: Blessed Lord, as I understand the meaning of the words spoken by the Blessed One, the precious jewel of the Buddha is not one thing, the precious jewel of the Dharma not another, the precious jewel of the Saṅgha not another, and the sameness of phenomena not yet another.

source: དགེ་འདུན་དཀོན་མཆོག་ཀྱང་གཞན་ཞིག་ལ། ཆོས་མཉམ་པ་ཉིད་ཀྱང་གཞན་མ་ལགས་ཀྱིས། བཅོམ་ལྡན་འདས་སངས་རྒྱས་དཀོན་མཆོག་གང་ལགས་པ་དང་། ཆོས་དཀོན་མཆོག་གང་ལགས་པ་དང་། དགེ་འདུན་དཀོན་མཆོག་གང་ལགས་པ་དེ་ཉིད་ཆོས་མཉམ་པ་ཉིད་དེ།
en: Rather, the precious jewel of the Buddha, the precious jewel of the Dharma, and the precious jewel of the Saṅgha are themselves the sameness of phenomena.

source: ཆོས་དེ་དག་ཐམས་ཅད་ནི་ལྡན་པ་འང་མ་ལགས་མི་ལྡན་པ་འང་མ་ལགས། གཟུགས་མ་མཆིས་པ་བསྟན་དུ་མ་མཆིས་པ། ཐོགས་པ་མ་མཆིས་པ་མཚན་ཉིད་གཅིག་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མ་མཆིས་པའོ།
en: All these attributes are neither conjoined nor disjoined, and they are immaterial, invisible, and unimpeded, with a single defining characteristic, in that they are without defining characteristics.

source: །དེ་ལྟར་ན་ཆོས་རྣམས་མཚན་ཉིད་མ་མཆིས་པ་ལ་འདི་ནི་སོ་སོའི་སྐྱེ་བོའོ།
en: In that case, since all phenomena are without defining characteristics, how is it within the perceptual range of the Blessed One to establish, ‘This is an ordinary person.

source: ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་།
en: VIII: 171} no longer subject to rebirth, an arhat, a pratyekabuddha, and a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའོ། །འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ།
en: This one is a tathāgata, arhat, completely awakened buddha’?” “

source: །ཞེས་རྣམ་པར་དགོད་པར་བགྱི་བ་དེ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཡུལ་ལོ།
en: Subhūti, it is so!

source: མཚན་ཉིད་མེད་པའི་ཆོས་རྣམས་རྣམ་པར་དགོད་པ་དེ་ནི། དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལོ།
en: The establishing of phenomena without defining characteristics is within the perceptual range of the tathāgatas.

source: །དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཐུའོ།
en: That is within the power of the tathāgatas.

source: །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། དེ་སྟེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཕྱིར་རོ། །ཆོས་རྣམས་རྣམ་པར་དགོད་པར་མ་མཛད་ན། སེམས་ཅན་དམྱལ་བ་ཡོད་པར་མངོན་ནམ།
en: Subhūti, do you think that if the tathāgatas, arhats, completely awakened buddhas were not to establish all phenomena in order that consummate buddhahood in enlightenment might be attained, the hells would be clearly discerned?

source: བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། མི་ཡོད་པར་མངོན་ནམ།
en: Would the animal realm, the world of Yama, and human beings be clearly discerned?

source: རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་ཡོད་པར་མངོན་ནམ། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་།
en: Would the gods of Caturmahā­rāja­kāyika be clearly discerned?

source: མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། ཤིན་ཏུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཡོད་པར་མངོན་ནམ།
en: Would the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, [Parīttabṛhat], Apramāṇabṛhat, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha be clearly discerned?

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི། ལྷ་ཡོད་པར་མངོན་ནམ།
en: Would the gods of the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception be clearly discerned? “

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོད་པར་མངོན་ནམ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: Would the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom be clearly discerned?

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོད་པར་མངོན་ནམ། བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་ཡོད་པར་མངོན་ནམ།
en: Would the ten levels of the bodhisattvas be clearly discerned?

source: ནང་སྟོང་པ་ཉིད་ཡོད་པར་མངོན་ནམ།
en: Would the emptiness of internal phenomena be clearly discerned?

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཡོད་པར་མངོན་ནམ། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: Would [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity, be clearly discerned?

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོད་པར་མངོན་ནམ། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: Would the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path be clearly discerned?

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཡོད་པར་མངོན་ནམ།
en: Would the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways be clearly discerned?

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོད་པར་མངོན་ནམ།
en: Would the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas be clearly discerned?

source: མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡོད་པར་མངོན་ནམ།
en: Would the thirty-two major marks of a great person and the eighty excellent minor marks be clearly discerned?

source: སངས་རྒྱས་དཀོན་མཆོག་དང་། ཆོས་དཀོན་མཆོག་དང་། དགེ་འདུན་དཀོན་མཆོག་ཡོད་པར་མངོན་ནམ།
en: Would the precious jewel of the Buddha, the precious jewel of the Dharma, and the precious jewel of the Saṅgha be clearly discerned?
